package Alishev.middleleveljava.lambda;
/**
 * Lambda появились с 8 версии Java
 * Lambda выражение это просто способ передать кусок кода в метод
 * Позволяют обойтись без использования анонимных классов
 * Они не привносят в язык нового функционала, просто позовляют делать то, что делали раньше просто более удобно сокращая объем кода
 *
 * Лямбда функция это МЕТОД БЕЗ НАЗВАНИЯ.
 *
 * Везде где нужно реализовывать анонимный класс или реализовывать 1 метод - это делается через Лямбда выражение
 * Любые интерфейсы с 1 методом, могут быть реализованны на месте
 */
public class Test  {
    public static void main(String[] args) {

    }
}
